# Задача 2
# Пользователь вводит две буквы. Определить, на каких местах алфавита они стоят, и сколько между ними находится букв.
# Блок-схема - https://drive.google.com/file/d/1XYYERoi2C27xupOds9ptWG8Y45rQ9Tqn/view?usp=sharing

letter_1 = (input('Введите первую букву от a до z: '))
letter_2 = (input('Введите вторую букву от a до z: '))

if 'a' <= letter_1 <= 'z' and 'a' <= letter_2 <= 'z':

    if letter_1 == 'a':
        m = 1
        print('Такому числу соотвествует буква алфавита - 1')
    elif letter_1 == 'b':
        m = 2
        print('Такому числу соотвествует буква алфавита - 2')
    elif letter_1 == 'c':
        m = 3
        print('Такому числу соотвествует буква алфавита - 3')
    elif letter_1 == 'd':
        m = 4
        print('Такому числу соотвествует буква алфавита - 4')
    elif letter_1 == 'e':
        m = 5
        print('Такому числу соотвествует буква алфавита - 5')
    elif letter_1 == 'f':
        m = 6
        print('Такому числу соотвествует буква алфавита - 6')
    elif letter_1 == 'g':
        m = 7
        print('Такому числу соотвествует буква алфавита - 7')
    elif letter_1 == 'h':
        m = 8
        print('Такому числу соотвествует буква алфавита - 8')
    elif letter_1 == 'i':
        m = 9
        print('Такому числу соотвествует буква алфавита - 9')
    elif letter_1 == 'j':
        m = 10
        print('Такому числу соотвествует буква алфавита - 10')
    elif letter_1 == 'k':
        m = 11
        print('Такому числу соотвествует буква алфавита - 11')
    elif letter_1 == 'l':
        m = 12
        print('Такому числу соотвествует буква алфавита - l2')
    elif letter_1 == 'm':
        m = 13
        print('Такому числу соотвествует буква алфавита - 13')
    elif letter_1 == 'n':
        m = 14
        print('Такому числу соотвествует буква алфавита - 14')
    elif letter_1 == 'o':
        m = 15
        print('Такому числу соотвествует буква алфавита - 15')
    elif letter_1 == 'p':
        m = 16
        print('Такому числу соотвествует буква алфавита - 16')
    elif letter_1 == 'q':
        m = 17
        print('Такому числу соотвествует буква алфавита - 17')
    elif letter_1 == 'r':
        m = 18
        print('Такому числу соотвествует буква алфавита - 18')
    elif letter_1 == 's':
        m = 19
        print('Такому числу соотвествует буква алфавита - 19')
    elif letter_1 == 't':
        m = 20
        print('Такому числу соотвествует буква алфавита - 20')
    elif letter_1 == 'u':
        m = 21
        print('Такому числу соотвествует буква алфавита - 21')
    elif letter_1 == 'v':
        m = 22
        print('Такому числу соотвествует буква алфавита - 22')
    elif letter_1 == 'w':
        m = 23
        print('Такому числу соотвествует буква алфавита - 23')
    elif letter_1 == 'x':
        m = 24
        print('Такому числу соотвествует буква алфавита - 24')
    elif letter_1 == 'y':
        m = 25
        print('Такому числу соотвествует буква алфавита - 25')
    elif letter_1 == 'z':
        m = 26
        print('Такому числу соотвествует буква алфавита - 26')
    elif letter_2 == 'a':
        n = 1
        print('Такому числу соотвествует буква алфавита - 1')
    elif letter_2 == 'b':
        n = 2
        print('Такому числу соотвествует буква алфавита - 2')
    elif letter_2 == 'c':
        n = 3
        print('Такому числу соотвествует буква алфавита - 3')
    elif letter_2 == 'd':
        n = 4
        print('Такому числу соотвествует буква алфавита - 4')
    elif letter_2 == 'e':
        n = 5
        print('Такому числу соотвествует буква алфавита - 5')
    elif letter_2 == 'f':
        n = 6
        print('Такому числу соотвествует буква алфавита - 6')
    elif letter_2 == 'g':
        n = 7
        print('Такому числу соотвествует буква алфавита - 7')
    elif letter_2 == 'h':
        n = 8
        print('Такому числу соотвествует буква алфавита - 8')
    elif letter_2 == 'i':
        n = 9
        print('Такому числу соотвествует буква алфавита - 9')
    elif letter_2 == 'j':
        n = 10
        print('Такому числу соотвествует буква алфавита - 10')
    elif letter_2 == 'k':
        n = 11
        print('Такому числу соотвествует буква алфавита - 11')
    elif letter_2 == 'l':
        n = 12
        print('Такому числу соотвествует буква алфавита - l2')
    elif letter_2 == 'n':
        n = 13
        print('Такому числу соотвествует буква алфавита - 13')
    elif letter_2 == 'n':
        n = 14
        print('Такому числу соотвествует буква алфавита - 14')
    elif letter_2 == 'o':
        n = 15
        print('Такому числу соотвествует буква алфавита - 15')
    elif letter_2 == 'p':
        n = 16
        print('Такому числу соотвествует буква алфавита - 16')
    elif letter_2 == 'q':
        n = 17
        print('Такому числу соотвествует буква алфавита - 17')
    elif letter_2 == 'r':
        n = 18
        print('Такому числу соотвествует буква алфавита - 18')
    elif letter_2 == 's':
        n = 19
        print('Такому числу соотвествует буква алфавита - 19')
    elif letter_2 == 't':
        n = 20
        print('Такому числу соотвествует буква алфавита - 20')
    elif letter_2 == 'u':
        n = 21
        print('Такому числу соотвествует буква алфавита - 21')
    elif letter_2 == 'v':
        n = 22
        print('Такому числу соотвествует буква алфавита - 22')
    elif letter_2 == 'w':
        n = 23
        print('Такому числу соотвествует буква алфавита - 23')
    elif letter_2 == 'x':
        n = 24
        print('Такому числу соотвествует буква алфавита - 24')
    elif letter_2 == 'y':
        n = 25
        print('Такому числу соотвествует буква алфавита - 25')
    elif letter_2 == 'z':
        n = 26
        print('Такому числу соотвествует буква алфавита - 26')

        s = n - m
        print('Между ними находится', s, 'букв')

else:
    print('Данному числу нельзя найти соотвыетствие в английском алфавите')